app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE (name like '%fili%')
SELECT "clients".* FROM "clients" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "clients"
---
  def index
    if params[:search]
      @clients = Client.search(params[:search])
    else
      #@clients = Client.all
      @clients = Client.page(params[:page]).per(10)

DELETE FROM "clients" WHERE "clients"."id" = $1  [["id", 9]]
---
  def destroy
    @client.destroy!

SELECT "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_client
      @client = Client.find(params[:id])