app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE (name like '%%')
SELECT "products".* FROM "products" WHERE (name like '%%') LIMIT $1  [["LIMIT", 11]]
SELECT COUNT(*) FROM "products"
---
  def index
    if params[:search]
      @products = Product.search(params[:search])
    else
      #@products = Product.all
      @products = Product.page(params[:page]).per(10)

INSERT INTO "products" ("code", "name", "price", "quantity", "category", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["code", 90080], ["name", "Vestido canelado"], ["price", 80.0], ["quantity", 2], ["category", "Vestido"], ["created_at", "2024-01-16 20:20:36.770401"], ["updated_at", "2024-01-16 20:20:36.770401"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "category" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["category", "Cropped"], ["updated_at", "2024-01-16 20:20:06.709711"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 5]]
---
  def destroy
    @product.destroy!