app/views/products/_form.html.erb

        <%= form.label t(:category), class: "form-label" %>
        <%= form.select :category_id, Category.pluck(:name, :id), {include_blank: true}, class: "form-control" %>
---
SELECT "categories"."name", "categories"."id" FROM "categories"